CREATE DATABASE RoGaKoPyta;
GO

USE RoGaKoPyta;
GO

CREATE TABLE Employees (
    EmployeeNumber NVARCHAR(20) PRIMARY KEY,
    LastName NVARCHAR(50),
    FirstName NVARCHAR(50),
    MiddleName NVARCHAR(50),
    Department NVARCHAR(100),
    Salary DECIMAL(18,2)
);

-- Заполнение таблицы случайными данными
INSERT INTO Employees (EmployeeNumber, LastName, FirstName, MiddleName, Department, Salary)
VALUES
    ('EMP0001', 'Иванов', 'Иван', 'Иванович', 'IT', 55000),
    ('EMP0002', 'Петров', 'Петр', 'Петрович', 'Отдел продаж', 48000),
    ('EMP0003', 'Сидорова', 'Мария', 'Федоровна', 'Бухгалтерия', 42000),
    ('EMP0004', 'Кузнецов', 'Алексей', 'Николаевич', 'Производство', 50000),
    ('EMP0005', 'Смирнова', 'Ольга', 'Викторовна', 'Маркетинг', 45000),
    ('EMP0006', 'Козлов', 'Дмитрий', 'Александрович', 'IT', 58000),
    ('EMP0007', 'Новиков', 'Андрей', 'Васильевич', 'Отдел продаж', 49000),
    ('EMP0008', 'Лебедева', 'Анна', 'Сергеевна', 'Бухгалтерия', 43000),
    ('EMP0009', 'Волков', 'Сергей', 'Иванович', 'Производство', 52000),
    ('EMP0010', 'Романова', 'Елена', 'Владимировна', 'Маркетинг', 46000),
    ('EMP0011', 'Михайлов', 'Дмитрий', 'Сергеевич', 'HR', 48000);
    ('EMP0012', 'Петров', 'Иван', 'Петрович', 'Отдел продаж', 51000),
    ('EMP0013', 'Сидорова', 'Мария', 'Федоровна', 'Бухгалтерия', 44000),
    ('EMP0014', 'Кузнецов', 'Алексей', 'Николаевич', 'Производство', 52000),
    ('EMP0015', 'Смирнова', 'Ольга', 'Викторовна', 'Маркетинг', 46000),
    ('EMP0016', 'Козлов', 'Дмитрий', 'Александрович', 'IT', 58000),
    ('EMP0017', 'Новиков', 'Андрей', 'Васильевич', 'Отдел продаж', 49000),
    ('EMP0018', 'Лебедева', 'Анна', 'Сергеевна', 'Бухгалтерия', 43000),
    ('EMP0019', 'Волков', 'Сергей', 'Иванович', 'Производство', 53000),
    ('EMP0020', 'Романова', 'Елена', 'Владимировна', 'Маркетинг', 47000),
    ('EMP0021', 'Соколова', 'Екатерина', 'Алексеевна', 'IT', 57000),
    ('EMP0022', 'Попов', 'Иван', 'Петрович', 'Отдел продаж', 51000),
    ('EMP0023', 'Бочарова', 'Ольга', 'Николаевна', 'Бухгалтерия', 44000),
    ('EMP0024', 'Иванов', 'Александр', 'Сергеевич', 'HR', 48000),
    ('EMP0025', 'Петрова', 'Елена', 'Ивановна', 'Отдел продаж', 50000),
    ('EMP0026', 'Сидоров', 'Дмитрий', 'Алексеевич', 'Бухгалтерия', 42000),
    ('EMP0027', 'Кузнецова', 'Анна', 'Петровна', 'Производство', 49000),
    ('EMP0028', 'Смирнов', 'Сергей', 'Васильевич', 'Маркетинг', 45000),
    ('EMP0029', 'Козлова', 'Мария', 'Николаевна', 'IT', 56000),
    ('EMP0030', 'Новикова', 'Ольга', 'Сергеевна', 'Отдел продаж', 48000),
    ('EMP0031', 'Лебедев', 'Алексей', 'Иванович', 'Бухгалтерия', 43000');
